# -*- coding: utf-8 -*-

BOT_NAME = 'douban'

SPIDER_MODULES = ['douban.spiders']
NEWSPIDER_MODULE = 'douban.spiders'

ROBOTSTXT_OBEY = False


DOWNLOAD_DELAY = 5

COOKIES_ENABLED = False

ITEM_PIPELINES = {
   'douban.pipelines.DoubanPipeline': 300,
}


Countrylist = ['美国', '日本', '香港', '英国', '中国', '法国', '韩国', '台湾', '德国', '中国大陆', '意大利', '印度', '内地', '泰国', '西班牙', '欧洲', '加拿大', '澳大利亚', '俄罗斯', '伊朗', '爱尔兰', '瑞典', '巴西', '丹麦', '波兰', '捷克', '阿根廷', '比利时', '墨西哥', '新西兰', '荷兰', '奥地利', '土耳其', '匈牙利', '以色列', '新加坡']
Decadelist = ['2015', '2013', '2014', '2011', '2012', '2010', '2016', '2009', '2008', '2007', '2006', '2004', '2005', '2003', '2001', '2002', '1994', '2000', '1997', '1999', '1998', '1995', '1996', '1993', '1992', '1990', '1991', '1988']
Categorylist = ['爱情', '喜剧', '动画', '剧情', '科幻', '动作', '经典', '悬疑', '青春', '犯罪', '惊悚', '文艺', '搞笑', '纪录片', '励志', '恐怖', '战争', '短片', '黑色幽默', '魔幻', '传记', '情色', '感人', '暴力', '动画短片', '家庭', '音乐', '童年', '浪漫', '黑帮', '女性', '同志', '史诗', '童话', '烂片', 'cult']